Revit 2024 API
CloudPoint.X Field
The X coordinate
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public float X
Visual Basic
Public X As Single
Visual C++
public:
float X
See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace